import streamlit as ast
ast.header("My dream astronomy🌠")
ast.title("✨ระบบสุริยะ")
ast.write("องค์ประกอบหลักของระบบสุริยะ  \nดวงอาทิตย์ (The Sun): เป็นดาวฤกษ์ศูนย์กลางที่มีมวลมากที่สุด คิดเป็น 99.8% ของมวลทั้งหมดในระบบสุริยะ ทำหน้าที่เป็นแหล่งพลังงานความร้อนและแสงสว่าง")
ast.write("ดาวเคราะห์ชั้นใน (Inner Planets): หรือดาวเคราะห์หิน เป็นดาวเคราะห์ที่อยู่ใกล้ดวงอาทิตย์ มีพื้นผิวเป็นของแข็ง ได้แก่ ดาวพุธ (Mercury), ดาวศุกร์ (Venus), โลก (Earth), และดาวอังคาร (Mars) ")
ast.image("solarsystem.jpg", caption="รูปภาพระบบสุริยะ")
ast.write("ดาวเคราะห์ชั้นนอก (Outer Planets): หรือดาวเคราะห์แก๊สและน้ำแข็ง เป็นดาวเคราะห์ขนาดใหญ่ที่อยู่ถัดออกไป ได้แก่ ดาวพฤหัสบดี (Jupiter), ดาวเสาร์ (Saturn), ดาวยูเรนัส (Uranus), และดาวเนปจูน (Neptune)  \nวัตถุขนาดเล็กอื่น ๆ: ประกอบด้วยดาวเคราะห์แคระ (เช่น ดาวพลูโต), ดาวเคราะห์น้อย (Asteroids), วัตถุในแถบไคเปอร์, ดาวหาง (Comets), และกลุ่มฝุ่นก๊าซ")
